[
	[
		{
			"speaker" : "blacksmith",
			"dialog" : "My apprentice, I gift to you the Legendary Ancient Blade of the Hero, or LABOTH for short.",
			"newSpeaker" : "true"
		},
		{
			"speaker" : "blacksmith",
			"dialog" : "The LABOTH is very powerful. It will guide itself to always block any attack, and it is able to kill most enemies in a single hit..."
		},
		{	
			"speaker" : "blacksmith",
			"dialog" : "...but it is also very, very old, and consequently very fragile."
		},
		{	
			"speaker" : "blacksmith",
			"dialog" : "Any time you strike an object, be it a foe or merely a wall, the blade will likely shatter, decreasing its length."
		},
		{	
			"speaker" : "blacksmith",
			"dialog" : "The blade will also shatter if it blocks an attack."
		},
		{	
			"speaker" : "blacksmith",
			"dialog" : "The LABOTH emits a magical light that illuminates the area around it. You can use the strength of this light to judge the reach of your attacks."
		},
		{	
			"speaker" : "blacksmith",
			"dialog" : "I've prepared an obstacle course for you to get accustomed to the LABOTH. It's stocked with several enemies, so that you may test your swordsmanship..."
		},
		{	
			"speaker" : "blacksmith",
			"dialog" : "...but don't feel too bad about fleeing, especially if you can get to a better position so you can strike without fear of shattering your sword upon the walls."
		},
		{	
			"speaker" : "",
			"dialog" : "\n<press [SPACEBAR] to swing the LABOTH>"
		}
	],
	[
		{
			"speaker" : "blacksmith",
			"dialog" : "By now your blade is likely damaged, leaving you vulnerable.",
			"newSpeaker" : "true"
		},
		{
			"speaker" : "blacksmith",
			"dialog" : "Fear not! Damaged equipment is no problem for a blacksmith, even a novice such as yourself!"
		},
		{	
			"speaker" : "blacksmith",
			"dialog" : "Here, take this hammer. You can use it to repair the LABOTH with obsidian shards, such as those commonly found among the old pots that litter dungeons.",
			"newSpeaker" : "true"
		},
		{	
			"speaker" : "",
			"dialog" : "\n<press [R] to repair your sword using collected shards>"
		},
		{	
			"speaker" : "blacksmith",
			"dialog" : "The hammer has additional uses beyond repairs.",
			"newSpeaker" : "true"
		},
		{	
			"speaker" : "blacksmith",
			"dialog" : "You can use it to smash open pots to reveal the obsidian shards within...",
			"newSpeaker" : "true"
		},
		{
			"speaker" : "blacksmith",
			"dialog" : "...or to smash the shells of enemies who might be mimicing those same pots!"
		},
		{
			"speaker" : "blacksmith",
			"dialog" : "The hammer can also temporarily stun enemies, but it takes a weapon such as the LABOTH to kill them for good."
		},
		{
			"speaker" : "blacksmith",
			"dialog" : "I've stocked the tunnels ahead with some pots so you can practice using your hammer."
		},
		{
			"speaker" : "blacksmith",
			"dialog" : "You can also use the obsidian you collect to repair the LABOTH, but remember:"
		},
		{
			"speaker" : "blacksmith",
			"dialog" : "a longer sword can take more damage and strike further out, but it may prove unwieldy in smaller spaces."
		},
		{
			"speaker" : "blacksmith",
			"dialog" : "Similarly, a shorter sword is less likely to strike something unintentionally, but can block fewer hits before it shatters completely."
		},
		{
			"speaker" : "blacksmith",
			"dialog" : "Now go out there and see what you can do!"
		},
		{
			"speaker" : "",
			"dialog" : "\n<while in the air, hold the [DOWN] arrow key to perform a hammer attack>"
		}
	]
]